{
  "education": [
    {
      "awards_achievements": [
        "Carleton University Entrance Scholarship",
        "Dean's List (2019)",
        "GPA: 3.37/4.0"
      ],
      "degree": "Bachelor of Computer Science",
      "department": "Computer Science",
      "duration": "2018-2023",
      "school_name": "Carleton University"
    },
    {
      "awards_achievements": null,
      "degree": "Certificate",
      "department": "Practical AI and Machine Learning",
      "duration": "2024-Present",
      "school_name": "George Brown College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_MichaelUzoegwu",
  "highlighted_projects": [
    {
      "description": "Developed an online resume builder using React and Firebase to facilitate the creation of my resumes as PDFs. The idea was born out of a need to ensure the visual consistency of my customized resume template across content-differing versions. Firebase was used to implement user authentication and resume storage, allowing different users to easily manage multiple versions of their resumes. I used this application exclusively for over two years to create resumes, which contributed to securing multiple internships.",
      "git_url": "https://github.com/micuzo/resume-editor",
      "name": "MyResume"
    },
    {
      "description": "Worked as part of a team of three on a 2D platformer-shooter game built with OpenGL and C++, where my main responsibilities were centered around interactions between game entities and the environment. I developed terrain rendering from level data stored in CSV files and implemented an efficient method for detecting collisions between game entities and terrain. Additionally, I applied Dijkstra?s pathfinding algorithm to determine optimal movement for enemy AI agents.",
      "name": "Last Resort"
    },
    {
      "description": "Created an X (formerly Twitter) bot with Python to tweet team lineups of the Manchester United soccer team in a more user-friendly format. The bot retrieves game start times and team lineups, ordered by player positions (instead of shirt numbers), through the API-Football. The start times are used to dynamically set a cron job that triggers the bot to tweet. The application was deployed on a remote Linux machine via DigitalOcean.",
      "name": "MulBot"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Enabled the Linux Cluster Administration (LCA) team to collect and store hardware specifications and system usage data of a Rocky Linux cluster of 10 nodes. This data was gathered using Bash scripts and persisted in a PostgreSQL database running within a Docker container.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Michael Uzoegwu",
  "others": [
    {
      "bullets": [
        "AWS Certified Solutions Architect Associate"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Been a soccer fan all my life",
        "Sci-fi enthusiast",
        "Learning Mandarin, building on what I learned in high school",
        "Working on personal projects and games"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked on hands-on projects in an Agile environment. Created a computer monitoring agent for a Linux cluster using Bash scripts and a Docker-contained PostgreSQL database.",
      "duration": "2024-Present",
      "title": "Software Developer"
    },
    {
      "company": "SurveyMonkey",
      "description": "Performed A/B tests on 100,000+ users by making experimental changes to web pages built with React and JavaScript. I also designed and developed a Chrome extension to streamline access to technical details that were buried and spread across browser developer tools. The extension was built using TypeScript and the Chrome Extensions API, with Webpack used for file bundling.",
      "duration": "2022-2022",
      "title": "Software Engineer Intern"
    },
    {
      "company": "ABB",
      "description": "Created and presented a proof of concept to automate the execution, validation, and reporting of existing manual tests. Test execution was automated using Python, Selenium, and Appium, with the Zephyr API leveraged for automating test reporting. Also conducted manual testing of an IoT application on iOS and Android, which led to the discovery of over 10 bugs.",
      "duration": "2022-2022",
      "title": "Software QA Intern"
    },
    {
      "company": "UKG",
      "description": "Worked across the stack, maintaining a MEAN (MongoDB, Express.js, Angular, Node.js) stack application used internally to track regression testing results. I implemented new features and bug fixes and communicated these changes with the rest of the team in every new release. Notably, I incorporated multi-field sorting of thousands of test results stored in a MongoDB database, utilizing Bootstrap and Angular Material UI to design and implement UI components, enabling easier analysis of test results.",
      "duration": "2021-2021",
      "title": "Software Developer Intern"
    },
    {
      "company": "Autodesk",
      "description": "Resolved issues in a C++ Qt application by investigating and implementing various fixes for compatibility with the newest operating systems. Additionally, automated the selection of the Xcode SDK in the application building process by modifying Python and Bash scripts, resulting in accelerated development workflows.",
      "duration": "2021-2021",
      "title": "Software Developer Intern"
    }
  ],
  "skills": {
    "competent": [
      "Java",
      "PostgreSQL",
      "Firebase",
      "AWS",
      "C++",
      "Express.js",
      "MongoDB",
      "Linux/Bash"
    ],
    "familiar": [
      "C#",
      "Qt",
      "Selenium",
      "WebPack",
      "OpenGL",
      "Pandas",
      "Numpy"
    ],
    "proficient": [
      "JavaScript / TypeScript",
      "Angular",
      "React",
      "Python",
      "HTML/CSS",
      "Node.js",
      "Git"
    ]
  },
  "summary": "I’m a Software Developer and recent Computer Science graduate with 16 months of internship experience in various fields, including web and desktop application development and quality assurance. During my teenage years, I immersed myself in coding by developing games using C# and Unity in my spare time. Attending university and working in the field broadened my horizons and helped me develop a broader passion for using software to create meaningful user experiences. Building on this experience, I’m excited to leverage my skills to contribute to impactful projects."
}
